In [1]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
from matplotlib import gridspec
import matplotlib.font_manager as fm
import seaborn as sns
import warnings
from scipy.special import boxcox1p, inv_boxcox1p

pd.options.display.float_format = '{:.5f}'.format
fontpath = 'C:/Users/TaeSoo/AppData/Local/Microsoft/Windows/Fonts/NanumGothic.ttf'
%matplotlib inline
warnings.filterwarnings(action='ignore')

plt.rcParams['figure.dpi'] = 140
plt.rcParams['font.family'] = 'NanumGothic'

9  872,396
10

In [58]:
tourist_df = pd.DataFrame(columns = ['base_date', 'total_tourist'])

In [60]:
tourist_df['base_date'] = ['202109', '202110', '202111', '202112', '202201', '202202', '202203', '202204', \
    '202205', '202206', '202207', '202208']

In [62]:
tourist_df['total_tourist'] = [872396, 1222094, 1204344, 1090607, 1170802, 1029503, 873086, 1178456, \
    1306537, 1283470, 1263332, np.nan]

In [63]:
tourist_df

   base_date  total_tourist
0     202109   872396.00000
1     202110  1222094.00000
2     202111  1204344.00000
3     202112  1090607.00000
4     202201  1170802.00000
5     202202  1029503.00000
6     202203   873086.00000
7     202204  1178456.00000
8     202205  1306537.00000
9     202206  1283470.00000
10    202207  1263332.00000
11    202208            NaN

In [64]:
tourist_df = tourist_df.fillna(1263332)

In [65]:
tourist_df

   base_date  total_tourist
0     202109   872396.00000
1     202110  1222094.00000
2     202111  1204344.00000
3     202112  1090607.00000
4     202201  1170802.00000
5     202202  1029503.00000
6     202203   873086.00000
7     202204  1178456.00000
8     202205  1306537.00000
9     202206  1283470.00000
10    202207  1263332.00000
11    202208  1263332.00000

In [66]:
tourist_df.to_csv('tourist.csv', encoding = 'utf-8-sig')